/*
 * File      : beep.h
 * beep application
 * COPYRIGHT (C) 2020, zc
 *
 * Change Logs:
 * Date           Author       Notes
 * 2020-5-4      zc           the first version
 */

/**
 * @addtogroup IMX6ULL
 */
/*@{*/
#ifndef _INCLUDE_BEEP_H
#define _INCLUDE_BEEP_H

/***************************************************************************
* Include Header Files
***************************************************************************/
#include "../include/UsrTypeDef.h"

/**************************************************************************
* Global Macro Definition
***************************************************************************/

/**************************************************************************
* Global Type Definition
***************************************************************************/

/**************************************************************************
* Global Variable Declaration
***************************************************************************/

/**************************************************************************
* Global Functon Declaration
***************************************************************************/

/*配置蜂鸣器的驱动*/
void BeepDriveInit(void);

/*释放蜂鸣器应用资源*/
void BeepDriverRelease(void);

/*获取蜂鸣器当前的状态*/
uint8_t BeepStatusRead(void);

/*修改蜂鸣器的当前状态*/
void BeepStatusConvert(uint8_t nBeepStatus);
#endif
